{
  "vegetables": [
    {
      "Name": "Carrot",
      "Latin_name": "Daucus carota",
      "Description": "Carrot is a root vegetable, typically orange in color, though there are purple, red, yellow, and white varieties. It is known for its crisp texture and high nutritional content, especially rich in beta-carotene, fiber, and vitamins.",
      "Flowers": "White, umbrella-shaped flowers only in the second year if allowed to grow (biennial cycle).",
      "Cycle": "Biennial (typically harvested in the first year, before flowering).",
      "Maintenance": "Low; requires regular watering, weed control, and occasional fertilization.",
      "Leaf_color": "Green",
      "Growth_rate": "Moderate; carrots are usually ready for harvest in 70 to 80 days after planting.",
      "Fruit": "N/A (Carrots are harvested for their roots, and if left to seed in the second year, they produce small seeds instead of fruit).",
      "Type": "Root vegetable",
      "Depth_water_requirement": "15–25 cm (6–10 inches) to ensure even moisture at root depth.",
      "Volume_water_requirement": "Moderate, requiring about 25-35 mm of water per week.",
      "Watering_period": "Water once every 5–7 days or when the top 2 cm of soil is dry.",
      "Watering_general_benchmark": "Keep soil consistently moist but avoid waterlogging. Mulching helps retain soil moisture.",
      "Wymiary": "Plants grow to about 30 cm (12 inches) tall; the root can grow up to 25 cm (10 inches) long.",
      "Poisonous": false,
      "Default_image": "carrot image generated above",
      "Plant_type": "Vegetable",
      "Sunlight": "Full sun to partial shade (minimum 6 hours of sunlight per day).",
      "Edible_parts": "Root (primary edible part, can be eaten raw or cooked)."
    },
    {
      "Name": "Tomato",
      "Latin_name": "Solanum lycopersicum",
      "Description": "Tomato is a widely grown fruit vegetable, commonly red in color, but there are also yellow, green, and purple varieties. It is rich in antioxidants like lycopene and vitamins C and K.",
      "Flowers": "Small, yellow flowers appear before the fruit starts forming.",
      "Cycle": "Annual (typically grown for one season).",
      "Maintenance": "Moderate; requires regular watering, staking, and protection from pests.",
      "Leaf_color": "Green",
      "Growth_rate": "Fast; tomatoes can be harvested within 60-80 days after planting.",
      "Fruit": "Round or oblong, varying in size and color depending on the variety.",
      "Type": "Fruit vegetable",
      "Depth_water_requirement": "30–45 cm (12–18 inches) to ensure even moisture at root depth.",
      "Volume_water_requirement": "High, requiring about 35-50 mm of water per week.",
      "Watering_period": "Water every 2-3 days, especially during dry spells.",
      "Watering_general_benchmark": "Keep the soil consistently moist, avoid dry spells and waterlogging.",
      "Wymiary": "Plants can grow up to 2 meters (6.5 feet) tall.",
      "Poisonous": false,
      "Default_image": "tomato image",
      "Plant_type": "Vegetable",
      "Sunlight": "Full sun (requires at least 6-8 hours of sunlight per day).",
      "Edible_parts": "Fruit (commonly eaten raw, cooked, or processed)."
    }
  ]
}
